---
type: CableTraySettings
namespace: Autodesk.Revit.DB.Electrical
version: 2024
members: 8
tags: [revit-api, class]
---

# CableTraySettings

`Autodesk.Revit.DB.Electrical.CableTraySettings` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetCableTraySettings | 2017 | `public static CableTraySettings GetCableTraySettings ( Document document )` |
| Property | ConnectorSeparator | 2017 | `public string ConnectorSeparator { get ; set ; }` |
| Property | FittingAnnotationSize | 2017 | `public double FittingAnnotationSize { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | RiseDropAnnotationSize | 2017 | `public double RiseDropAnnotationSize { get ; set ; }` |
| Property | SizeSeparator | 2017 | `public string SizeSeparator { get ; set ; }` |
| Property | SizeSuffix | 2017 | `public string SizeSuffix { get ; set ; }` |
| Property | UseAnnotationScaleForSingleLineFittings | 2017 | `public bool UseAnnotationScaleForSingleLineFittings { get ; set ; }` |